<?php
return [
    'required' => 'هذه الخانة مطلوبة!',
    'email' => 'يجب أن يكون :attribute بريدًا إلكترونيًا صالحًا.',
    'max' => [
        'string' => 'يجب ألا يتجاوز :attribute :max أحرف.',
    ],
    'min' => [
        'string' => 'يجب أن يكون :attribute :min أحرف على الأقل.',
    ],
    'unique' => 'لقد تم استخدام :attribute بالفعل.',
    'regex' => [
        'full_name' => 'يُسمح فقط بالحروف والمسافات والواصلات والفواصل العليا.',
        'user_name' => 'يُسمح فقط بالحروف والأرقام والشرطات السفلية والواصلات.',
        'phone' => 'يُسمح فقط بالأرقام.',
        'whatsapp_number' => 'يُسمح فقط بالأرقام.',
        'password' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل وحرف خاص واحد.',
    ],
    'image' => 'يجب أن يكون :attribute صورة.',
    'mimes' => 'يجب أن يكون :attribute ملفًا من النوع: :values.',
    'confirmed' => 'تأكيد :attribute غير متطابق.',
    'attributes' => [
        'full_name' => 'الاسم الكامل',
        'user_name' => 'اسم المستخدم',
        'email' => 'البريد الإلكتروني',
        'address' => 'العنوان',
        'password' => 'كلمة المرور',
        'phone' => 'رقم الهاتف',
        'whatsapp_number' => 'رقم واتساب',
        'user_image' => 'صورة المستخدم',
    ],
];
